[
    {
        "img": "https://baxtiyor.uz/wp-content/uploads/2019/08/kitob-foydalari.jpg",
        "text":"1. O‘qish yangi va noyob fikrlar tug‘ilishiga yordam beradi. Mutolaa bizni fikrlashga chorlaydi. Ba’zan, orzularimiz ham biz o‘qigan, xursand qilgan kitob bilan bog‘liq bo‘ladi. Shuningdek, mutolaa bizning dunyoqarashimizni boyitadi. Inson o‘qish orqali yangi fikrlar va yorqin g‘oyalar oladi. Inson o‘zi bilmagan holda ilhomlanib o‘qishi, yangi va o‘zgacha fikrlar yuzaga kelishiga turtki beradi. 2. O‘qish inson fikrini jamlaydi va diqqat markazini oshiradi. Mutolaa jarayonida, o‘qigan hikoya va asarga butun diqqat-e’tibor qaratiladi. Inson boshqa ishlardan ko‘ra kitobga ko‘proq diqqat qiladi. Inson miyasi bir vaqtning o‘zida turli faoliyatlar bilan shug‘ullana olmaydi. Shu sababli ko‘p o‘qigan odamning diqqatini bir joyga to‘plash ancha oson kechadi. 3. O‘qish tasavvurni oshiradi. Biz o‘zimizga notanish bo‘lgan joylar haqida o‘qiganimizda, idrokimiz tasavvurlarimiz ishga tushib tasvirlarni miyamizda yarata boshlaydi va shu orqali xotiramizda tasvirlar saqlanib boradi. Binobarin, idrokimizning tasavvur qilishi va yaratuvchanligi kitob o‘qish orqali mustahkamlanib boradi. 4. O‘qish chet tilini o‘rganishni osonlashtiradi. Doimiy ravishda kitob o‘qish boshqa tillarni o‘rganishda yangi so‘zlarni oson tushunishga va yodda saqlab qolishga yordam beradi. Xorijiy tilni o‘rganayotgan kishi o‘sha tilning adabiyotlarini muntazam o‘qishi orqali o‘sha tilni qisqa fursatda o‘zlashtirishi mumkinligi olimlar tomonidan isbotlangan. 5. Birgalikda kitob o‘qish ota-onalar va bolalarning o‘zaro munosabatlarini yaxshilaydi. Inson o‘z farzandini kitob mutolaasiga o‘rgatar ekan, avvalo o‘zi ham bu ishda o‘rnak bo‘lishi kerak. Psixologlar birgalikda kitob o‘qish jarayonida ota-onalar va bolalar o‘rtasida o‘ziga xos munosabat o‘rnatiladi deb hisoblashadi. Ularning aytishlaricha, bunday munosabat birgalikda televizor ko‘rganda aslo paydo bo‘lmasligini ta’kidlashmoqda. 6. O‘qish sizni zukkolikka yetaklaydi. Kitoblar manbalar va yangi bilimlarning haqiqiy xazinasidir. Shuningdek, ular hozirgi paytdagi turli xildagi o‘quv kurslari ta’limidan ancha arzon hisoblanadi. Qanchalik ko‘p kitob o‘qigani sari insonning zukkoligi va teran fikrlash qobiliyati shunchalik oshib boradi. Shu bilan birga, inson turli mavzularda qanchalik ko‘p kitob o‘qisa, o‘z bilimini oshirishi bilan bir qatorda, o‘zaro muloqot qilish san’atini ham yaxshi egallaydi. 7. O‘qish miya faoliyatini mustahkamlaydi. Inson odatda o‘qigan kitobi to‘g‘risida o‘ylashi uchun vaqti ko‘p bo‘ladi. Emori universiteti olimlari kitob o‘qigan insonning aqliy salohiyati bir necha kun davomida yuqori holatda bo‘lishini isbotlashdi. Tadqiqot mualliflari kitob o‘qish miyadagi asab tolalarini mustahakamlashini ta’kidlashmoqda. 8. O‘qish til mahoratimizni yaxshilaydi. Xorijiy tilda biror adabiyotni o‘qish dastlab katta harakat talab etadi, lekin bu bizning so‘z boyligimiz oshishiga xizmat qiladi. Boshqa tilni tushunishda ba’zan uning turli qismlarini tarjima qilishga ehtiyoj seziladi va ular lug‘atdan qidiriladi. Kitob o‘qish nafaqat so‘z boyligini balki umumiy savodxonlikni ham oshiradi. Qaysi tilda o‘qishdan qat’iy nazar, mutolaa orqali gapning konteksti qay tarzda yasalishini o‘rganish mumkin bo‘ladi. 9. O‘qish stressni kamaytiradi. Inson kitob mutolaa qilar ekan, o‘sha paytda uni hech qanday topshiriq yoki xavotir o‘ylantirmas ekan. Kitob mutolaa qilishda biz ko‘pincha o‘zimizga qulay usulda joylashib olamiz. Tanamiz umuman birorta maxsus harakatni amalga oshirmaydi va dam oladi. Nafas olish sekinlashadi va tinchlanamiz. Biz o‘zimizni dunyoda sodir bo‘layotgan hodisalar tasviri so‘zlar orqali kitobda aks etganini tasavvur eta boshlaymiz. Bularning barchasiga sabab mutolaa stressni kamaytirishidir. 10. O‘qish bizning so‘z boyligimizni oshirishga xizmat qiladi. Tadqiqotlarga qaraganda, kitob mutolaasi bilan shug‘ullanuvchilarning so‘z boyligi boshqa insonlarga nisbatan yuqori bo‘lishi isbotlangan va shu sababli ular boshqalarga aytishni xohlagan so‘z ifodalarini juda ham osonlik bilan ifodalab beradilar. Qisqa qilib aytganda, qancha ko‘p o‘qisangiz shuncha ko‘p so‘z boyligiga ega bo‘lasiz. Shuningdek, kitoblar shubhasiz bilimlar xazinasidir.","title": "Kitob O’qishning Biz Bilgan Va Bilmagan 10 Ta Foydasi"
    },
    {
        "img": "https://prep.uz/storage/posts/March2020/istockphoto-1047570732-612x6121.jpg",
        "text": "Bugungi kunda dunyoda taxminan 1,5 milliard kishi ingliz tilida gaplashadi. Eng ko’p o’qitiladigan til bo’lgan ingliz tili boshqa tillarni almashtirmaydi, balki ularni to’ldiradi. Sizning e’tiboringizga ingliz tiliga tegishli bir nechta qiziqarli faktlarni taqdim etamiz:   90 mamlakatda ingliz tili ikkinchi til yoki keng o’rganilmoqda. Gonkongda o’nta o’rta maktabning to’qqiztasida o’quvchilarlar ingliz tilini o’rganishadi. Fransiya davlatining o’rta maktablari o’quvchilarga to’rt yil davomida ingliz yoki nemis tillarini o’rganishni talab qiladi, aksariyat kamida 85% - ingliz tilini tanlaydi. 300 million xitoyliklar (AQShning butun aholisidan ko’proq) ingliz tilini o’rganishmoqda. Yaponiyada talabalar o’rta maktabni bitirmasdan oldin olti yil davomida ingliz tilini o’rganishlari kerak. Norvegiya, Shvetsiya va Daniyada ingliz tilini o’rganish talab qilinadi. Buyuk Britaniyani hisobga olmaganda, barcha Yevropa davlatlari orasida Gollandiya ingliz tilini biladiganlar soni bo’yicha birinchi o’rinda turadi. Portugaliya Yevropa hamjamiyatiga qo’shilganidan beri, ingliz tili darslariga bo’lgan talab fransuz sinflariga bo’lgan talabga qaraganda kuchli. D. Kristalning ta’kidlashicha, ilgari hech qachon odamlar shunchalik ko’p va sayohat qilishmagan va bundan oldin har xil xalqlar o’rtasida biznes va madaniy aloqalar bunchalik ko’p bo’lmagan. Shu sababli global til bo’lgan, ingliz tilini chet tili sifatida o’rganish tobora ommalashib bormoqda. ",
        "title": "Crazy English - Ingliz tili haqida qiziqarli faktlar"
    },
    {
        "img": "https://news.store.rambler.ru/img/624bb9641e165f998955bdb814fe780e",
        "text": "Sport bilan shug’ullanish sog‘liq uchun foydali. Lekin uni kunning qaysi qismida amalga oshirish juda muhim. Mutaxassislar iloji boricha mashg‘ulotlarni  tongda bajarishni tavsiya etadi. Ertalabdan bajarilgan mashqlar kun davomida tetiklik hamda yaxshi kayfiyat baxsh etadi. Erta tongdan bir yarim soat mobaynida sport bilan shug‘ullanish natijasida kun davomida ishtaha bo‘lmaydi va ortiqcha ovqatlanish xavfini kamaytiradi. Brigam Yang universiteti tomonidan olib borilgan tadqiqotlar shuni ko‘rsatdiki, atigi 45 daqiqalik kuchli jismoniy mashqlar oziq-ovqatga, ayniqsa, shirinlikka bo‘lgan ishtiyoqni kamaytiradi. Och qoringa jismoniy mashq bajarish har kim uchun ham to‘g‘ri kelavermaydi. Ammo ko‘plab ilmiy tadqiqotlar buning samaradorligini isbotlagan. Agar shifokor maslahatidan so‘ng organizmda biror salbiy o‘zgarish sezilmasa, och holatda olib borilgan mashg‘ulotlar vazn yo‘qotishda tezroq samara beradi. Shuningdek, ovqatlanmasdan olib borilgan mashg‘ulotlar ovqatdan so‘ng bajarilgan mashqlarning natijasiga qaraganda 20 foiz yuqorida turadi. Agar maqsad vazn to‘plash bo‘lsa, mashg‘ulot oldidan oqsilga boy bo‘lgan mahsulotlarni iste’mol qilish mumkin. Ertalabki mashqlar adrenalin va kortizol gormonlarining tarqalishiga yordam beradi. Bular stress gormonlari bo‘lishiga qaramay, aynan ular hushyorlik va ogohlikni sezilarli darajada oshiradi. Agar ish, turmush muammolari qiynayotgan bo‘lsa, jismoniy mashqlar tanani uyg‘otadi va miya faoliyatini yaxshilaydi. Ma’lumki, muntazam ravishda mashq qilish energiya darajasini oshiradi va charchoqni bartaraf etishga yordam beradi. Statistik ma’lumotlarga ko‘ra, haftasiga 3-4 marta jismoniy mashqlar bilan shug‘ullangan odamlar boshqalarga qaraganda 65 foiz kamroq charchoqni his qiladi. Agar jismoniy mashq kunning birinchi yarmida amalga oshirilsa, kun davomida charchoq deyarli sezilmaydi. Jismoniy mashqlar paytida kortizoldan tashqari, baxt gormonlari – serotonin va dofamin ajralib chiqadi. Kuchli mashqlar stress gormonlari darajasini barqarorlashtiradi va ularning qondagi konsentratsiyasini nazorat qilishga yordam beradi. Ertalabki mashqlar butun kun uchun yaxshi kayfiyat baxsh etadi va turli qiyinchiliklarga bardoshli bo‘lishda yordam beradi.",
        "title": "Erta tongda sport bilan shug‘ullanishning organizmga 7 foydasi"
    },
    {
        "img": "https://aniq.uz/photos/news/jIEjTtCr9wwUGbt.jpeg",
        "text": "Yuqumli kasalliklar ayni kunda insonlarning asosiy dushmaniga aylanib qolgan. Ma'lumotlarga ko'ra, sentyabr` oyida shamollash, gripp va tumovga chalingan insonlarning soni yoz oyiga nisbatan bir necha marta o'sgan. Bunday vaziyatda birinchi o'rinda immunitetni mustahkamlashga kirishish kerak. Afsuski, tez yoki bir martalik urinish bunga yordam bermaydi. Immunitetni yaxshilash uchun muntazam ravishda berilgan tavsiyalarga amal qilish zarur. Albatta, bular unchalik ham qiyin emas. Uyquning me'yorida bo'lmasligi immunitet tizimini sezilarli darajada susaytiradi, umumiy holatga, soch, teriga salbiy ta'sir o'tkazadi. Hattoki vazn ortishiga ham olib keladi. Tadqiqot natijalariga ko'ra, muntazam ravishda 7 soatdan kam uxlaydigan insonlar boshqa insonlarga nisbatan 4 marotaba ko'proq shamollaydi. Tun – dam olish va resurslarni qayta tiklash vaqti. Agar dam olish uchun etarli vaqt bo'lmasa, tana zaiflashadi va tashqi ta'sirlardan o'zini himoya qila olmaydi. Ish kunlari hamda dam olish kunlari bir vaqtning o'zida uxlashga va uyg'onishga harakat qilish kerak. Bu uxlaydigan vaqtni boshqarishda va tana soatini me'yorlashtirishda yordam beradi. Uxlashdan avval xona havosini tozalash kerak. Hatto qish kunlarida ham xona 20 daqiqa davomida shamollatilishi kerak. CHunki bu insonni tiniqib uxlashi uchun zarur bo'lgan kislorodning bir qismini ta'minlaydi. Ayni makon va bugungi kun bilan yashashga odatlanish kerak. O'tmishdagi muvaffaqiyatsizliklar va kelajakda amalga oshmagan ishlar uchun xavotirlanish natijasida ko'p energiya sarflanadi. Bu odat nafaqat psixologik, balki jismoniy sog'liq uchun ham zararli. Aynan hozirgi kunga e'tibor qaratish qobiliyati stressni sezilarli darajada pasaytiradi. Bu butun organizmning ishlashiga foydali ta'sir ko'rsatadi. O'simlikdan tayyorlanadigan maxsus choy ichish stress darajasini pasaytirishda, immunitetni mustahkamlashda yaxshi ta'sir ko'rsatadi. Minnatdorlik amaliyoti bir qarashda bema'nilikka o'xshashi mumkin, ammo uning stressni minimallashtirishdagi samaradorligi ko'plab ilmiy tadqiqotlar bilan tasdiqlangan. Inson har kuni o'zi minnatdor bo'ladigan narsalarni izlab topishi va baland ovozda aytishi yoki yozishi ham mumkin. Kuchli immunitet va faol turmush tarzi o'rtasidagi bog'likni tasdiqlagan tadqiqotlar sonini hisoblash qiyin, ammo natijasi hamma uchun bir xil. Muntazam jismoniy mashqlar T hujayralarini ishlab chiqarishni rag'batlantiradi, bu esa viruslardan asosiy himoyachi hisoblanadi. Bundan tashqari juda ko'p miqdordagi jismoniy mashqlar stress garmoni − kortizol ishlab chiqarishni kamaytirishga yordam beradi, bu yuqorida aytilganidek, virusli kasalliklar xavfini oshiradi. Agar sport zalida maxsus mashg'ulotlar amalga oshirilsa, ortiqchasini jismga yuklamaslik kerak. Sababi mashqlar tana uchun qiyin bo'lsa, u nafaqat samarasiz, balki tanaga jiddiy zarar etkazishi ham mumkin. Muntazam ravishda uyda o'tiradiganlar toza havoda ko'proq yurishi tavsiya etiladi. YUrish uchun kuniga kamida 30-40 daqiqa vaqt ajratish zarur. Piyoda yurish mushaklar holatini yaxshilashga yordam beradi, xavfsiz yurak faolligini ta'minlaydi va tinchlantirishda ham qo'l keladi. Agar ish jarayoni kuni bilan komp`yuter yonida o'tirishni talab etsa, har soatda 5 daqiqa ichida xonani ikki marotaba aylanish kerak. Bu qonning yaxshi aylanishiga hamda tana tetiklashishiga yordam beradi.",
        "title": "Sog'lom bo'lish sirlari"
    },

    {
        "img": "https://www.gazeta.uz/media/img/2018/12/SjAp2B15459836122126_b.jpg",
        "text": "‘zbekiston sharoitida olim bo‘lish iqtisodiy jihatdan foyda keltiradimi? Yoshlarning olim bo‘lishiga undovchi besh sabab — Nazokat Azim maqolasida. Maktabni bitirish arafasidagi yigit-qiz borki, kelajakda kim bo‘lsam ekan, deb boshini qotiradi. Faqat yoshlar emas, ularning ota-onalari, qarindosh-urug‘lari, ustoz-o‘qituvchilari, do‘stu yorlari ham bu masala o‘ylantiradi. Axir kasb insonning kelajagi, uning taqdirini belgilaydi, boringki u butun umrini qay darajada baxtiyor o‘tkazishi ham qaysidir ma’noda kasbi koriga bog‘liq. Vaqti-vaqti bilan jamiyat uchun eng zarur, eng ko‘p maosh beriladigan, eng mavqesi baland kasblar ro‘yxatlari ham e’lon qilinadiki, tanlov oldida turgan yoshlardan shulardan birortasini tanlab qo‘ya qolsammikan, deb xam o‘ylab qolishi ajab emas. Ammo bugungi maqolamiz bilan yoshlarga aytar gapimiz quyidagicha: o‘zingiz istagan, yoqtirgan, orzu qilgan kasbingizni tanlang! Nega deysizmi? Chunki odam o‘zi yaxshi ko‘rgan, iqtidori ko‘proq bo‘lgan kasbu korini tanlasagina muvaffaqiyatga erishadi-da. Muhimi, qanday kasb tanlamang, shu kasbning haqiqiy ustasi bo‘ling! Negaki, aslida gap qanday kasbni tanlashda emas, balki shu kasbni qay darajada mukammal egallashdadir. Yurtimizda aynan olimlar yetishmasligini bilasizmi? Germaniyaning Federal statistika idora saytidagi ma’lumotlarga qaraganda 2015 yili har 1 000 000 kishiga olimlar soni O‘zbekistonda — 515 nafarni, Qozog‘istonda — 734, Xitoyda — 1177, Malayziyada — 2261, BAA -2003, Rossiyada — 3131, Fransiyada — 4169, Germaniyada — 4431, Italiyada — 2018, Ukrainada — 1006, Angliyada — 4055, AQSHda — 4232 nafarni tashkil etgan. Hozirgi kunda O‘zbekistonda 1500 mingdan ziyod 30 yoshgacha bo‘lgan yoshlar turli xil ixtirolari uchun patentlar olgan. Bu ko‘rsatkich faqatgina O‘zbekistondagi davlat oliy ta’lim muassasalari miqyosidagi statistik ma’lumotlar bo‘lib, aslida yosh ixtirochilarimizning soni bundan-da ko‘pligi quvontiradi. Aynan shunday yoshlarni qo‘llab-quvvatlash maqsadida 2019 yildan boshlab, yosh olimlar, talabalar, umuman tashabbuskor fuqarolar «Innovatsion g‘oyalar yetakchisi» ko‘krak nishoni bilan taqdirlanadilar. Joriy yilning 1 aprelidan 30 aprelgacha ko‘krak nishoni bilan taqdirlashga oid davlat va nodavlat notijorat tashkilotlari, tadbirkorlik sub’ektlari taqdim etayotgan dastlabki takliflar tuman va shahar hokimliklarida tuzilgan komissiyalar tomonidan qabul qilinmoqda. Tadqiqotlar bilan, tadqiqotlarni amalga tatbiq qilish bilan shug‘ullanayotgan yoshlarning e’tirof etilishi yurtimizda ilm-fan bilan shug‘ullanish qay darajada nufuzli ekanini anglatadi. Xulosa o‘rnida esa olimlar nafaqaga chiqmaydilar. Nafaqa yoshiga yetganlarida ham ular o‘zlarini jamiyat uchun kerakli insonlar deb hisoblaydilar. Bugungi maqola auditoriyasiga, balki, nafaqa to‘g‘risida o‘ylash erish tuyulsa-da, buni ham so‘ngso‘z o‘rnida eslatib o‘tishni joiz topdik. Zero, yoshlikda olingan, bilim toshga o‘yilgan naqshdek.",
        "title": "Yoshlarning olim bo‘lishiga besh sabab"
    },

    {
        "img": "https://static.terabayt.uz/crop/s/3/728_410_DgghHZNADQTi2KR6iXUwrASrPIZDuhRe.jpg",
        "text": "Dasturlash — kompyuterlar va boshqa mikroprotsessorli elektron mashinalar uchun dasturlar tuzish, sinash va oʻzgartirish jarayonidan iborat. Odatda dasturlash yuqori saviyali dasturlash tillari (PHP, Java, C++, Python ) vositasida amalga oshiriladi. Bu dasturlash tillarining semantikasi odam tiliga yaqinligi tufayli dastur tuzish jarayoni ancha oson kechadi. Dasturlash 1) elektron mashinalarda masalalarni yechish hamda ularda har xil aqliy mehnat turlarini bajarish nazariyasi va usullarini ishlab chiqish bilan shugʻullanadigan fan; algoritmlar nazariyasining amaliy boʻlimi; insonning mashina bilan aloqa qilish vositasi. Asosiy vazifalaridan biri elektron mashinalar uchun programma (dastur) tuzish usullari, ularni tekshirish va takomillashtirishdan iborat. Yechilishi lozim boʻlgan masala algoritmi Dasturlashda „mashina tili“ga oʻtkaziladi. Dasturlash — bevosita dasturlash va avtomatik dasturlashga boʻlinadi. Bevosita Dasturlashda programmaning umumiy sxemasini ishlab chiqishdan kodlash va mashinaga kiritishgacha boʻlgan barcha ishni programmachi bajaradi. Avtomatik dasturlashda esa programmachi faqat programma sxemasini tuzib, uni qisqartirilgan simvolik kurinishda yozadi, programma tuzish va uni kodlash kabi texnikaviy ishlarni esa mashinaning oʻzi maxsus dasturlash programmasi yordamida bajaradi. Dasturlash tili programmalar tuzishning asosiy vositasidir. Bu tillar konkret mashina komandalari sistemasiga bog`liq boʻlmasligi va iboralar strukturasi jihatidan umumiy xususiyatga ega boʻlishi bilan boshqa tabiiy tillarga oʻxshab ketadi. Iboralar ikki turga — operatorlar hamda tavsiflarga boʻlinadi, ularning bir-biri bilan bogʻliqligi qavslar bilan, alohidaligi nuqtali vergul bilan ajratiladi. Operator tilning amal birligi boʻlib, oʻz navbatida, oʻzgaruvchan kattalikka qiymat beruvchi operatorlar, shartga muvofiq tegishli hisoblash tarmogʻini tanlovchi (shartli) operator va takroriy hisobni amalga oshiruvchi sikl operatorlariga boʻlinadi. Tavsifda oʻzgaruvchan kattalik va boshqa belgilar xususiyatlari yoziladi. Biror xususiy masalani yechish uchun tuzilgan programmani simvolik ravishda funksional belgilash mumkin. Bunday belgilash va tavsif birgalikda kichik programma deb yuritiladi. Yangi programmalar tuzishda kichik programmalardan tayyor holda foydalanish mumkin. Juda koʻp dasturlash tillari (algol-60, q. Algol), muhandislik va ilmiy masalalarni yechish uchun fortran, iqtisodiy hisoblashlar uchun kobol, matematik modellar uchun si mula, tako-millashgan algol-68, PL/I yaratildi. Ularning har biri uchun shu tillarda ifodalangan masalalarga qarab mashina programmasini avtomatik tarzda qaytatuzuvchi translyatorlar mavjud. Taxminiy mashina tili ikkilik sistemadan koʻra yanada qulayroq simvollarda ifodalangan mashina komandalari terminlaridagi programmalar boʻlib, bunda koʻpincha, yuqori darajadagi til sifatida blok sxemalardan foydalaniladi. Dasturlashning programma tuzilgandan keyingi yana bir asosiy bosqichi „tekshirish“ (otladka) boʻlib, bunda yoʻl qoʻyilgan xatolar topiladi va tuzatiladi. Programmalar kodlanadi va mashinaga maxsus qurilma yordamida kiritiladi. Amaliyotda Dasturlashning yangi va tezkor usullari bor (2004); 2) matematik dasturlash — amaliy matematikaning bir boʻlimi; umumiy maʼnoda — biron-bir funksiya fo(x) ning ekstremumini (qarang Ekstremum) topish masalasi tushuniladi.",
        "title": "Dasturlash haqida to'liq ma'lumot"
    },

    {
        "img": "https://avatars.dzeninfra.ru/get-zen_doc/3385297/pub_5ecc1f418689093b98385798_5ecc1f704de5fb7517cb723b/scale_1200",
        "text": "Bugungi kunda zamonaviy axborot texnologiyalarsiz korxonalar faoliyatini rivojlantirish masalasini hech kim tasavvuriga sig‘dira olmaydi. Chunki hozirda axbarot kommunikasion texnologiyalari shiddat bilan rivojlanib bormoqda, bu esa korxonalarga o‘z faoliyatiga yangi innovasion texnika va texnologiyalarni kiritish, yuqori texnologiyalardan foydalanib raqobatbardoshligini oshirish vazifalarini yuklaydi. Mamlakatimizda “Aqlli shahar” texnologiyalarini joriy etish konsepsiyasi qabul qilinib, unga ko‘ra “aqlli transport”, “aqlli ta'lim”, “aqlli tibbiyot”, “aqlli energetika tizimi”, “aqlli qurilish, “aqlli kommunal xo‘jalik”, “aqlli uy”, “aqlli hokimiyat”, “aqlli mahalla” kabi loyihalar “Aqlli shahar” texnologiyalarini joriy etishning asosiy yo‘nalishlari sifatida belgilandi. Shu bilan birgalikda mamlakatimizning aksariyat korxonalarida AKTni joriy etish masalalarida bir qancha muammolar saqlanib qolmoqda. O‘zbekiston Respublikasini yanada rivojlantirish bo‘yicha Harakatlar strategiyasini faol investisiyalar va ijtimoiy rivojlanish yilidagi ijrosi bo‘yicha dasturda ham bunga katta ahamiyat qaratilgan. O‘zbekiston Respublikasida chuqur, keng ko‘lamli islohotlar amalga oshirilar ekan, uzluksiz huquqiy ta'lim tizimini shakllantirishga katta ahamiyat berilmoqda. Darhaqiqat, kelajagi buyuk davlatni qurish tafakkuri, dunyoqarashi o‘zgargan rahbar xodimlarimiz, mutaxassislarimizning faoliyatiga ko‘p jihatdan chambarchas bog‘liqdir. Shu bois, yangicha fikrlaydigan, o‘z xizmat sohasi va faoliyatiga zamonaviy axborot-kommunikasiya texnologiyalarini samarali qo‘llay oladigan, yuksak malakali, chuqur bilimli rahbar xodimlarni tayyorlash bugungi kunda davr talabi bo‘lib qoldi. Zamonaviy hayotimizda axborot texnologiyalari ijtimoiy ishlab chiqarishning barcha jabhalarida faoliyat yurituvchi barcha turdagi tashkilotlarni boshqarishda qo‘llaniladi. Axborotni boshqarish texnologiyalarining eng ustun va aniq afzalliklari tijorat tashkilotlar amaliyotida paydo bo‘la boshladi. Axborot texnologiyalariga oid dastlabki ma'lumotlar akademik M.T.O‘rozboev tashabbusi bilan fanga kiritilgan bo‘lib, birinchi marta V.I. Romanovskiy nomli matematika instituti qoshida Hisoblash texnikasi bo‘limi ochilgan. Akademik S.S.G‘ulomov ham axborot texnologiyalarini rivojlanishida qator tadqiqot ishlarini olib borgan. Akademik V.Q.Qobulov fikriga ko‘ra “Iqtisodiy kibernetika-mashina texnologiyalariga asoslangan holda ijtimoiy-iqtisodiy jarayonlarni o‘rganadigan yangi fanga aylanmoqda”. Korxonalarda axborot texnologiyalarini rivojlantirish yuzasidan O‘zbekiston Respublikasining “Axborotlashtirish to‘g‘risida”gi, “Elektron hukumat to‘g‘risida”gi, “Elektron raqamli imzo to‘g‘risida”gi qonunlarida ham alohida to‘xtalib o‘tilgan.",
        "title": "AQLLI TEXNOLOGIYАLAR"
    }
]